{
    "Welcome": { "cz": "Vítejte" },
    "In 2020, I completed a web-development bootcamp at the highly acclaimed": {
        "cz": "V roce 2020 jsem absolvoval bootcamp zaměřený na vývoj webových aplikací na renomované"
    },
    "and was invited to join Better Plan as a Full-Stack Developer. I worked there until March 2021, when I left to focus on my high-school examinations.": {
        "cz": "a byl jsem pozván, abych se připojil k Better Plan jako Full-Stack Developer. Pracoval jsem tam až do března 2021, kdy jsem odešel, abych se mohl soustředit na maturitní zkoušky."
    },
    "After a year of learning Czech, I began my studies in Applied Informatics at": {
        "cz": "Po roce studia češtiny jsem zahájil studium Aplikované informatiky na"
    },
    "University of Jan Evangelista": {
        "cz": "Univerzitě Jana Evangelisty"
    },
    "Two months later, I received a full-time offer from": {
        "cz": "O dva měsíce později jsem obdržel nabídku na plný úvazek od"
    },
    "as a Software Engineer. I worked in the Platform team, focusing on performance optimization and the development of design components leveraged by Product teams.": {
        "cz": "jako Software Engineer. Pracoval jsem v Platformovém týmu, zaměřeném na optimalizaci výkonu a vývoj designových komponent využívaných produktovými týmy."
    },
    "During my time at Pipedrive, I significantly improved my skills in JavaScript, TypeScript, and React, while gaining experience with Node.js frameworks, cloud infrastructure, and SQL databases.": {
        "cz": "Během svého působení v Pipedrive jsem výrazně zlepšil své dovednosti v JavaScript, TypeScript a React, a zároveň jsem získal zkušenosti s frameworky Node.js, cloudovou infrastrukturou a databázemi SQL."
    },
    "In late 2024, I decided to pursue studies abroad, leaving the company in early 2025 to enroll in a program in": {
        "cz": "Na konci roku 2024 jsem se rozhodl pokračovat ve studiu v zahraničí, a tak jsem na začátku roku 2025 opustil práce, abych se zapsal do programu na"
    },
    "University of Malaga": {
        "cz": "Univerzitě v Malaze"
    },
    "focused on cybersecurity, machine learning, and artificial intelligence.": {
        "cz": "zaměřeného na kybernetickou bezpečnost, strojové učení a umělou inteligenci."
    },
    "Upon returning from Spain, I focused on my Bachelor's thesis. By late 2025, once all the necessary administrative processes were completed, I had the time to continue developing both my technical and soft skills.": {
        "cz": "Po návratu ze Španělska jsem se soustředil na svou bakalářskou práci. Koncem roku 2025, jakmile byly dokončeny všechny potřebné administrativní záležitosti, jsem měl čas pokračovat ve zdokonalování svých technických i soft dovedností."
    },
    "While I’m not actively job hunting, I’m always open to exciting opportunities. You can reach me via LinkedIn or Telegram below.": {
        "cz": "I když momentálně aktivně nehledám práci, jsem vždy otevřen zajímavým příležitostem. Můžete mě kontaktovat přes LinkedIn nebo Telegramu níže."
    }
}
